# Quiz : 당신은 Cocoa 서비스를 이용하는 택시 기사님입니다.
# 50명의 승객과 매칭 기회가 있을 때, 총 탑승 승객 수를 구하는 프로그램을 작성하시오.

# 조건1) 승객별 운행 소요 시간은 5분 ~ 50분 사이의 난수로 결정
# 조건2) 이 중에서 소요 시간이 5분 ~ 15분 사이의 승객만 매칭할 것

# ex) 출력문 예제
# [O] 1번째 손님 (소요시간 : 15분)
# [ ] 2번째 손님 (소요시간 : 50분)
# [O] 3번째 손님 (소요시간 : 5분)
...
# [ ] 50번째 손님 (소요시간 : 16분)

# 총 탑승 승객 : 2 명

from random import *

cnt = 0    # 총 승객의 수
for i in range(1, 51):    # 1부터 50까지의 손님
    time = randrange(5, 51)    # 5~50분 사이인 소요 시간
    if 5 <= time <= 15:    # 매칭 성공한 경우
        print("[O] {}번째 손님 (소요시간 : {}분)".format(cnt, time))
        cnt += 1
    else:    # 매칭 실패한 경우
        print("[] {}번째 손님 (소요시간 : {}분)".format(cnt, time))

print("총 탑승 승객 : {}명".format(cnt))

